src/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровОрдерныйСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровОрдерныйСклад</Name>
			<Comment>Остатки товаров на ордерном складе</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Храним ТОЛЬКО в базовых единицах измерения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Comment>Ячейка склада</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Используется только для аналитики. Это НЕ означает, что в ресурс «Количество» пишется в данной единице измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваровОтданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровОтданные</Name>
			<Comment>Блок учета партий товаров отданных на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество переданного на комиссию товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимостиРегл</Name>
					<Comment>Себестоимость товаров, переданных на реализацию в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимостиНДСРегл</Name>
					<Comment>Сумма НДС себестоимости товаров в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимостиБезНДСРегл</Name>
					<Comment>Сумма себестоимости товаров в валюте регламентированного учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимостиУпр</Name>
					<Comment>Себестоимость товаров, переданных на реализацию, в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимостиНДСУпр</Name>
					<Comment>Сумма НДС себестоимости товаров в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСебестоимостиБезНДСУпр</Name>
					<Comment>Сумма себестоимости товаров в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Комиссионер которому мы передали товар на комиссию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура переданная на комиссию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор комиссии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Comment>Документ передачи товаров на комиссию</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Документ по которому наша компания купила данный товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>Заказы поставщикам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма заказанной номенклатуры рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonModules/ЗаполнениеДокументовСервер/Ext/Module.bsl
// Общий модуль "Заполнение документов (сервер)"


//////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ

// Процедура заполнения складскими остатками.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Функция ЗагрузитьИзТСД(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыЗаполнения.ЗагрузитьИзТСД.Свойство("ТаблицаТоваров") 
		И ТипЗнч(ПараметрыЗаполнения.ЗагрузитьИзТСД.ТаблицаТоваров)=Тип("Массив") Тогда
	
		// Определим в какое имя у реквизита описывающего Количество.
		Если ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.Инвентаризация") Тогда
			ИмяРеквизитаКоличество = "КоличествоФакт";
		ИначеЕсли ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.ИнвентаризацияОрдерногоСклада") Тогда
			ИмяРеквизитаКоличество = "КоличествоУчет";
		Иначе
			ИмяРеквизитаКоличество = "Количество";
		КонецЕсли;
		
		Для каждого СтрокаТоваров Из ПараметрыЗаполнения.ЗагрузитьИзТСД.ТаблицаТоваров Цикл
			
			Если СтрокаТоваров.ШтрихКод="" ИЛИ НЕ ЗначениеЗаполнено(СтрокаТоваров.Количество) Тогда
				Продолжить;
			КонецЕсли;
			
			// Поиск объектов по штрихкоду.
			ОбъектыПоШтрихкоду = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(СтрокаТоваров.ШтрихКод,,Истина);
			
			// Вызываем обработчик изменения данных объекта.
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
			
			Для Каждого ОбъектПоШтрихкоду Из ОбъектыПоШтрихкоду Цикл
				
				Если ОбъектПоШтрихкоду.Запрет Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураСтроки = Новый Структура;
				СтруктураСтроки.Вставить("Номенклатура",               ОбъектПоШтрихкоду.Объект);
				СтруктураСтроки.Вставить(ИмяРеквизитаКоличество,       СтрокаТоваров.Количество);
				СтруктураСтроки.Вставить("ЕдиницаИзмерения",           ОбъектПоШтрихкоду.ЕдиницаИзмерения);
				СтруктураСтроки.Вставить("ХарактеристикаНоменклатуры", ОбъектПоШтрихкоду.ХарактеристикаНоменклатуры);
				СтруктураСтроки.Вставить("Штрихкод",                   ОбъектПоШтрихкоду.Штрихкод);
				СтруктураСтроки.Вставить("Запрет",                     ОбъектПоШтрихкоду.Запрет);
				
				СтрокаТабличнойЧасти = Объект[ПараметрыЗаполнения.ИмяТабличнойЧасти].Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураСтроки);
				
				ПараметрыДействия = Новый Структура;
				ПараметрыДействия.Вставить("НеЗаполнятьКоличествоФакт",Истина);
				
				ПараметрыВыполнения = Новый Массив;
				ПараметрыВыполнения.Добавить(Объект);
				ПараметрыВыполнения.Добавить(СтрокаТабличнойЧасти);
				ПараметрыВыполнения.Добавить(ПараметрыДействия);
				Имя = СтрЗаменить(Строка(МенеджерОбъекта), "ДокументМенеджер", "Документы");
				РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "."+ПараметрыЗаполнения.ИмяТабличнойЧасти+"НоменклатураПриИзменении", ПараметрыЗаполнения);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции //ЗагрузитьИзТСД()

// Процедура заполнения складскими остатками.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Функция ЗагрузкаИзФайла(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Получим параметры работы.
	АдресТаблицаЗагрузкаИЗФайлаВХранилище = ПараметрыЗаполнения.ЗагрузкаИзФайла.АдресТаблицаЗагрузкаИЗФайлаВХранилище;
	ИмяТабличнойЧасти                     = ПараметрыЗаполнения.ЗагрузкаИзФайла.ИмяТабличнойЧасти;
	
	// Производим заполнение таблицы объекта.
	Если ЗначениеЗаполнено(АдресТаблицаЗагрузкаИЗФайлаВХранилище) Тогда
		ТаблицаТоваров = ПолучитьИзВременногоХранилища(АдресТаблицаЗагрузкаИЗФайлаВХранилище);
		Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
			НовСтр = Объект[ИмяТабличнойЧасти].Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрокаТоваров);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции //ЗагрузкаИзФайла()

// Процедура заполнения складскими остатками.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Функция УстановитьНаценкуДляВсейТаблицы(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Получим менеджер объекта.
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = МенеджерОбъекта.ПолучитьПараметрыДействия(Объект);
	
	// Изменим значение процента.
	Для Каждого ТекСтрока Из Объект[ПараметрыЗаполнения.ИмяТабличнойЧасти] Цикл
		
		ТекСтрока.ПроцентНаценки=ПараметрыЗаполнения.ЗначениеПроцента;
		ПараметрыВыполнения = Новый Массив;
		ПараметрыВыполнения.Добавить(Объект);
		ПараметрыВыполнения.Добавить(ТекСтрока);
		Имя = СтрЗаменить(Строка(МенеджерОбъекта), "ДокументМенеджер", "Документы");
		РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "."+ПараметрыЗаполнения.ИмяТабличнойЧасти+"ПроцентНаценкиПриИзменении", ПараметрыВыполнения);
		
	КонецЦикла;
	
КонецФункции //УстановитьНаценкуДляВсейТаблицы()

// Процедура заполнения по документу.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Функция ЗаполнениеПоДокументу(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	Если ЕстьРеквизит(ПараметрыЗаполнения.ЗаполнитьПоДокументуВыборСсылки,, ПараметрыЗаполнения.ИмяТабличнойЧасти) Тогда
		
		ДанныеЗаполнения = ПараметрыЗаполнения.ЗаполнитьПоДокументуВыборСсылки;
		
		// Получим менеджера текущего объекта.
		Если ЕстьРеквизит(Объект, "Номенклатура", ПараметрыЗаполнения.ИмяТабличнойЧасти) Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		Иначе
			МенеджерОбъекта = Неопределено;
		КонецЕсли;
		
		ИменаИсключаемыхРеквизитов = "НомерСтроки";
		
		// Для документа "Закрытие смены" не будем заполнять скидки.
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗакрытиеСмены") И ПараметрыЗаполнения.ИмяТабличнойЧасти = "Товары" Тогда
			ИменаИсключаемыхРеквизитов = ",ПроцентСкидки,СуммаСкидки";
		КонецЕсли;
		
		// Идем по строкам и реквизитам табличной части и заполняем соответствующие.
		Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения[ПараметрыЗаполнения.ИмяТабличнойЧасти] Цикл
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") 
				И ПараметрыЗаполнения.ИмяТабличнойЧасти = "Товары" 
				И СтрокаТабличнойЧасти.Количество = 0 Тогда
				
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект[ПараметрыЗаполнения.ИмяТабличнойЧасти].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти,, ИменаИсключаемыхРеквизитов);
			
			Если ЕстьРеквизит(Объект, "КоличествоБазовое", ПараметрыЗаполнения.ИмяТабличнойЧасти) 
				И НЕ ЗначениеЗаполнено(НоваяСтрока.КоличествоБазовое) 
				И ЕстьРеквизит(Объект, "Количество", ПараметрыЗаполнения.ИмяТабличнойЧасти) 
				И ЕстьРеквизит(Объект, "Коэффициент", ПараметрыЗаполнения.ИмяТабличнойЧасти) Тогда
				
				НоваяСтрока.КоличествоБазовое = НоваяСтрока.Количество * НоваяСтрока.Коэффициент;
			КонецЕсли;
			
			Если НЕ МенеджерОбъекта=Неопределено Тогда
				
				ПараметрыВыполнения = Новый Массив;
				ПараметрыВыполнения.Добавить(Объект);
				ПараметрыВыполнения.Добавить(НоваяСтрока);
				Имя = СтрЗаменить(Строка(МенеджерОбъекта), "ДокументМенеджер", "Документы");
				РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "."+ПараметрыЗаполнения.ИмяТабличнойЧасти +"НоменклатураПриИзменении", ПараметрыВыполнения);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции //ЗаполнениеПоДокументу()

// Процедура заполнения складскими остатками.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Процедура ЗаполнитьТоварыСкладскимиОстатками(Объект, ПараметрОповещения) Экспорт
	
	ТаблицаОстатков = ПолучитьСкладскиеОстатки(Объект, ПараметрОповещения);
	Объект[ПараметрОповещения.ИмяТабличнойЧасти].Загрузить(ТаблицаОстатков);
	
	Если ТаблицаОстатков.Количество() <> 0 Тогда
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		
		Для Каждого СтрокаТЧ Из Объект[ПараметрОповещения.ИмяТабличнойЧасти] Цикл
			
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(Объект);
			ПараметрыВыполнения.Добавить(СтрокаТЧ);
			Имя = СтрЗаменить(Строка(МенеджерОбъекта), "ДокументМенеджер", "Документы");
			РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "."+ПараметрОповещения.ИмяТабличнойЧасти+"НоменклатураПриИзменении", ПараметрыВыполнения);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция получения складских остатков.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Функция ПолучитьСкладскиеОстатки(Объект, ПараметрОповещения) Экспорт
	
	// получим дополнительные фильтры для заполнения, если они есть в параметрах.
	ГруппаНоменклатуры = ПолучитьЗначениеПараметраСтруктуры(ПараметрОповещения, "ГруппаНоменклатуры", Неопределено);
	СкладКомпании      = ПолучитьЗначениеПараметраСтруктуры(ПараметрОповещения, "СкладКомпании",      Неопределено);
	ИмяРегистра        = ПолучитьЗначениеПараметраСтруктуры(ПараметрОповещения, "ИмяРегистра",        Неопределено);
	Ячейка	           = ПолучитьЗначениеПараметраСтруктуры(ПараметрОповещения, "Ячейка",             Неопределено);
	
	Если НЕ ЗначениеЗаполнено(СкладКомпании) Тогда
		СкладКомпании = Объект.СкладКомпании;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Дата = Объект.Дата;
	Иначе
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Момент = Новый МоментВремени(Дата);
	
	ДопФильтр = ?(ЗначениеЗаполнено(ГруппаНоменклатуры), " И Номенклатура В ИЕРАРХИИ(&ВыбГруппа)", "");
	Если Ячейка<>Неопределено Тогда
		ЯчейкаФильтр = " И Ячейка = &Ячейка ";
	Иначе
		ЯчейкаФильтр = "";
	КонецЕсли; 

	
	Запрос = Новый Запрос;
	
	Если ИмяРегистра=Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 0) = 0
		|			ТОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
		|		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.КоличествоОстаток / ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 0) = 0
		|			ТОГДА ОстаткиТоваровКомпанииОстатки.РезервОстаток
		|		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.РезервОстаток / ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Резерв
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&Момент, СкладКомпании = &СкладКомпании "+ДопФильтр+") КАК ОстаткиТоваровКомпанииОстатки";
		
		Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
		Запрос.УстановитьПараметр("Момент",        Момент);
		Запрос.УстановитьПараметр("ВыбГруппа",     ГруппаНоменклатуры);
		
	ИначеЕсли ИмяРегистра="ОстаткиТоваровОрдерныйСклад" И СкладКомпании <> Неопределено Тогда
		
		ТестЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОрдерныйСкладОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,";
		
		// Если склад ячеистый, добавим измерение "Ячейка"
		Если СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Ячеистый 
			ИЛИ СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.ОрдерныйЯчеистый Тогда
			
			ТестЗапроса= ТестЗапроса + "
			|	ОстаткиТоваровОрдерныйСкладОстатки.Ячейка КАК Ячейка,";
		КонецЕсли;
		
		// Если ведется учет единиц измерения по складу, добавим измерение "ЕдиницаИзмерения".
		Если СкладКомпании.УчетЕдиницИзмерения=Перечисления.ВидыУчетаЕдиницИзмерения.НеВедется Тогда
			ТестЗапроса = ТестЗапроса + "
			|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,";
		Иначе
			ТестЗапроса = ТестЗапроса + "
			|	ОстаткиТоваровОрдерныйСкладОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,";
		КонецЕсли;
		
		ТестЗапроса = ТестЗапроса + "
		|	ВЫБОР КОГДА ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент,0) = 0 ТОГДА
		|		ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток
		|	ИНАЧЕ
		|		ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток/ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(&Момент,СкладКомпании=&СкладКомпании " + ЯчейкаФильтр + ДопФильтр +") КАК ОстаткиТоваровОрдерныйСкладОстатки";
		
		Запрос.Текст = ТестЗапроса;
		Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
		Запрос.УстановитьПараметр("Момент",        Момент);
		Запрос.УстановитьПараметр("ВыбГруппа",     ГруппаНоменклатуры);
		Если Ячейка<>Неопределено Тогда
			Запрос.УстановитьПараметр("Ячейка",     Ячейка);
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура заполнения складскими остатками.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Процедура ЗаполнитьТоварыПоДоговоруКомиссии(Объект, ПараметрОповещения) Экспорт
	
	ТаблицаТоваров = ПолучитьТоварыПоДоговоруКомиссии(Объект, ПараметрОповещения);
	Объект[ПараметрОповещения.ИмяТабличнойЧасти].Загрузить(ТаблицаТоваров);
	
	Если ТаблицаТоваров.Количество() <> 0 Тогда
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		
		Для Каждого СтрокаТЧ Из Объект[ПараметрОповещения.ИмяТабличнойЧасти] Цикл
			
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(Объект);
			ПараметрыВыполнения.Добавить(СтрокаТЧ);
			Имя = СтрЗаменить(Строка(МенеджерОбъекта), "ДокументМенеджер", "Документы");
			РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "."+ПараметрОповещения.ИмяТабличнойЧасти+"НоменклатураПриИзменении", ПараметрыВыполнения);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция получения таблицы товаров по договору комиссии.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Функция ПолучитьТоварыПоДоговоруКомиссии(Объект, ПараметрОповещения) Экспорт
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Дата = Объект.Дата;
	Иначе
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровОтданныеОстатки.Номенклатура КАК Номенклатура,
	|	ПартииТоваровОтданныеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровОтданныеОстатки.ДокументПередачи КАК ДокументПередачи,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПартииТоваровОтданныеОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 0) = 0
	|			ТОГДА ПартииТоваровОтданныеОстатки.КоличествоОстаток
	|		ИНАЧЕ ПартииТоваровОтданныеОстатки.КоличествоОстаток / ПартииТоваровОтданныеОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ПартииТоваровОтданныеОстатки.СуммаУпрОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОтданные.Остатки(
	|			&Момент,
	|				Контрагент = &Контрагент
	|				И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов) КАК ПартииТоваровОтданныеОстатки
	|ГДЕ
	|	ПартииТоваровОтданныеОстатки.КоличествоОстаток > 0";
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("Контрагент",            Объект.Контрагент);
	Запрос.УстановитьПараметр("Момент",                Новый Граница(Новый МоментВремени(Дата), ВидГраницы.Исключая));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТоварыПоДоговоруКомиссии()

// Процедура заполнения заказами контрагенту.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Процедура ЗаполнитьЗаказамиКонтрагенту(Объект, ПараметрОповещения) Экспорт
	
	ТаблицаТоваров = ПолучитьТоварыПоЗаказамКонтрагенту(Объект, ПараметрОповещения);
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);

	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		НоваяСтрока								= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура				= СтрокаТоваров.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаТоваров.ХарактеристикаНоменклатуры;
		
		ПараметрыВыполнения = Новый Массив;
		ПараметрыВыполнения.Добавить(Объект);
		ПараметрыВыполнения.Добавить(НоваяСтрока);
		Имя = СтрЗаменить(Строка(МенеджерОбъекта), "ДокументМенеджер", "Документы");
		РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "." + ПараметрОповещения.ИмяТабличнойЧасти+"НоменклатураПриИзменении", ПараметрыВыполнения);
		
		НоваяСтрока.Количество					= СтрокаТоваров.ЗаказаноОстаток;
		
		ПараметрыВыполнения = Новый Массив;
		ПараметрыВыполнения.Добавить(Объект);
		ПараметрыВыполнения.Добавить(НоваяСтрока);
		Имя = СтрЗаменить(Строка(МенеджерОбъекта), "ДокументМенеджер", "Документы");
		РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(Имя + "." + ПараметрОповещения.ИмяТабличнойЧасти+"КоличествоПриИзменении", ПараметрыВыполнения);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция получения таблицы товаров по заказам контрагенту.
//
// Параметры:
//   Объект              - Документ  - Заполняемый документ
//   ПараметрОповещения  - Структура - Структура параметров, необходимых для заполнения складскими остатками.
//                                     При необходимости хранит дополнительные фильтры.
//
Функция ПолучитьТоварыПоЗаказамКонтрагенту(Объект, ПараметрОповещения) Экспорт
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Дата = Объект.Дата;
	Иначе
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Момент = Новый МоментВремени(Дата);

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
	|	СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток) КАК ЗаказаноОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Момент, Контрагент = &Контрагент И ЗаказПоставщику.ПодразделениеКомпании=&ПодразделениеКомпании) КАК ЗаказыПоставщикамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Момент", 				Момент);
	Запрос.УстановитьПараметр("Контрагент", 			Объект.Контрагент);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", 	Объект.ПодразделениеКомпании);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Обработчик  пунктов подменю "Заполнение" панели "КоманднаяПанельАктивы".
//
Функция ЗаполнитьТабличнуюЧастьАктивами(Объект, ПараметрОповещения) Экспорт
	
	ИмяПодменю = ПараметрОповещения.ИмяКоманды;
	
	Если ИмяПодменю = "АктивыЗаполнитьАктивамиПодразделения" Тогда
		
		// Надо заполнить таблицу активами подразделения.
		ВыбПодразделение = Объект.ПодразделениеКомпании;
		Попытка
			ВыбМОЛ = ПараметрОповещения.МолОтбор;
		Исключение
			ВыбМОЛ = Неопределено;
		КонецПопытки;
		
		// Запрос по активам
		МоментВремени = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), Новый МоментВремени(КонецДня(Объект.Дата)), 
			Новый МоментВремени(Объект.Дата));
		// На случай, если документ уже проведен,правим момент расчета
		МоментВремени = ?(Объект.Ссылка.Пустая(), 
			Новый Граница(Новый МоментВремени(Объект.Дата, Объект.Ссылка),ВидГраницы.Исключая), МоментВремени);
		
		Если Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка)).Имя = "Амортизация" Тогда
			ТаблАктивы = УправлениеПрочимиАктивами.ПолучитьОстаткиАктивовНеАмортизированных(МоментВремени, ВыбПодразделение);
		Иначе
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("Подразделение", ВыбПодразделение);
			ПараметрыЗапроса.Вставить("МОЛ",           ВыбМОЛ);
			ПараметрыЗапроса.Вставить("Момент",        МоментВремени);
			ТаблАктивы = УправлениеПрочимиАктивами.ПолучитьОстаткиАктивов(ПараметрыЗапроса);
		КонецЕсли;
		
		Возврат ТаблАктивы;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗаполнитьСкладскимиОстаткамиПоВыбраннойЯчейке(Объект, ПараметрОповещения) Экспорт
	
		Запрос    = Новый Запрос();
		ДопФильтр = " И (НЕ Номенклатура.ВидНоменклатуры=ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга))";
		
		ДопФильтр = ДопФильтр + " И Ячейка В (&МассивЯчеек)";
		Запрос.УстановитьПараметр("МассивЯчеек", ПараметрОповещения.МассивЯчеек);  		
		
		ТестЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОрдерныйСкладОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ОстаткиТоваровОрдерныйСкладОстатки.Ячейка КАК Ячейка,";
				
		// Если ведется учет единиц измерения по складу, добавим измерение "ЕдиницаИзмерения".
		Если ПараметрОповещения.СкладКомпании.УчетЕдиницИзмерения <> Перечисления.ВидыУчетаЕдиницИзмерения.НеВедется Тогда
			ТестЗапроса= ТестЗапроса + "
			|	ОстаткиТоваровОрдерныйСкладОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,";
		КонецЕсли; 
		
		ТестЗапроса= ТестЗапроса + "
		|	ВЫБОР КОГДА ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент,0) = 0 ТОГДА
		|		ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток
		|	ИНАЧЕ 
		|		ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток/ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Количество 
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(&Момент,СкладКомпании=&СкладКомпании "+ДопФильтр+") КАК ОстаткиТоваровОрдерныйСкладОстатки";
		
		Запрос.Текст  = ТестЗапроса;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			МоментВремени = Новый МоментВремени(КонецДня(Объект.Дата));
		Иначе
			МоментВремени = Новый МоментВремени(Объект.Дата);
		КонецЕсли; 
		Запрос.УстановитьПараметр("Момент",       МоментВремени);
		Запрос.УстановитьПараметр("СкладКомпании",Объект.СкладКомпании);
		
		Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции



//////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УПРАВЛЕНИЯ КОМАНДАМИ ЗАПОЛНЕНИЯ

// Процедура добавления команды заполнения в документ.
//
// Параметры
//	КомандыЗаполнения
//	ИмяКоманды
//	ИмяТабличнойЧасти
//	ПредставлениеКоманды
//	ПараметрыКоманды
//	ПорядокГруппы
//	ПорядокВГруппе
//	Картинка.
//
Процедура ДобавитьКоманду(КомандыЗаполнения, ИмяКоманды, ИмяОбработчикаКоманды="", ИмяТабличнойЧасти, ПредставлениеКоманды, Знач ПараметрыКоманды=Неопределено, Картинка=Неопределено, ПорядокГруппы=1, ПорядокВГруппе=Неопределено, ОчиститьПередЗаполнением=ИСТИНА, ПодтверждениеПередЗаполнением=ЛОЖЬ, ВидимостьКоманды=Истина, ИзменяетСохраняемыеДанные=Истина) Экспорт
	
	// Произведем уточнение некоторых переданных параметров.
	Если ПустаяСтрока(ИмяОбработчикаКоманды) Тогда
		ИмяОбработчикаКоманды = ИмяКоманды;
	КонецЕсли;
	Если ПараметрыКоманды=Неопределено Тогда
		ПараметрыКоманды = Новый Структура();
	КонецЕсли;
	
	// Найдем имеющуюся или добавим новую команду в коллекцию.
	НайденныеСтроки = КомандыЗаполнения.НайтиСтроки(Новый Структура("ИмяКоманды,ИмяТабличнойЧасти", ИмяКоманды, 
																											ИмяТабличнойЧасти));
	Если НайденныеСтроки.Количество() > 0 Тогда
		КомандаЗаполнения = НайденныеСтроки[0];
	Иначе
		КомандаЗаполнения = КомандыЗаполнения.Добавить();
	КонецЕсли;
	
	// Устанавливаем значения переданных параметров.
	КомандаЗаполнения.ИмяКоманды                    = ИмяКоманды;
	КомандаЗаполнения.ИмяОбработчикаКоманды         = ИмяОбработчикаКоманды;
	КомандаЗаполнения.ИмяТабличнойЧасти             = ИмяТабличнойЧасти;
	КомандаЗаполнения.ПредставлениеКоманды          = ПредставлениеКоманды;
	КомандаЗаполнения.ПараметрыКоманды              = Новый Структура();
	КомандаЗаполнения.ШаблонПараметрыКоманды        = ПараметрыКоманды;
	КомандаЗаполнения.Картинка                      = Картинка;
	КомандаЗаполнения.ПорядокГруппы                 = ПорядокГруппы;
	КомандаЗаполнения.ПорядокВГруппе                = ?(ПорядокВГруппе=Неопределено, КомандыЗаполнения.Количество(), ПорядокВГруппе);
	КомандаЗаполнения.ОчиститьПередЗаполнением      = ОчиститьПередЗаполнением;
	КомандаЗаполнения.ПодтверждениеПередЗаполнением = ПодтверждениеПередЗаполнением;
	КомандаЗаполнения.ВидимостьКоманды              = ВидимостьКоманды;
	КомандаЗаполнения.ИзменяетСохраняемыеДанные     = ?(ПодтверждениеПередЗаполнением,Истина,ИзменяетСохраняемыеДанные);
	
КонецПроцедуры

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект,ПараметрыКоманд) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	Для Каждого ТабличнаяЧасть Из Объект.Ссылка.Метаданные().ТабличныеЧасти Цикл
		
		// Команда установки процента наценки.
		Если ЕстьРеквизит(Объект, "СкладКомпании") И ЕстьРеквизит(Объект,"ПроцентНаценки",ТабличнаяЧасть.Имя) Тогда
			
			РазрешитьРедактироватьЗакупочныеЦены = Ложь;
			Если ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") Тогда
				РазрешитьРедактироватьЗакупочныеЦены = Объект.ДоговорВзаиморасчетов.РазрешитьРедактироватьЗакупочныеЦены;
			КонецЕсли;
			
			ЭтоРозничныйСклад = (ЗначениеЗаполнено(Объект.СкладКомпании) 
				И ТипЗнч(Объект.СкладКомпании)=Тип("СправочникСсылка.СкладыКомпании") И Объект.СкладКомпании.Розничный);
			РазрешитьРедактированиеЦенИСумм = (РазрешитьРедактироватьЗакупочныеЦены ИЛИ ПравоПользователя("РедактированиеЦенИСуммВНоменклатурныхТаблицах", Объект));
			РазрешитьИзменятьРозничныеЦены  = ПравоПользователя("ИзменятьРозничныеЦеныВПоступленииТоваров", Объект);
			РедактированиеДоступно = ЭтоРозничныйСклад И НЕ ((НЕ РазрешитьРедактированиеЦенИСумм) 
														 ИЛИ (НЕ РазрешитьИзменятьРозничныеЦены) 
														 ИЛИ Объект.СкладКомпании.ТипЦенРозничнойТорговли.Рассчитывается);
			ПараметрыКоманд.Вставить(ТабличнаяЧасть.Имя + "УстановитьНаценкуДляВсейТаблицы.Видимость", РедактированиеДоступно);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки.
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ ДОКУМЕНТА

// Создает пустую таблицу для размещения в нее команд заполнения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - описание команд заполнения.
//
//  Параметры:
//	ИмяКоманды			  - Строка	-		Полное имя команды заполнения, по которому менеджер заполнения определяет какое
// 											заполнение необходимо вызвать. Имя команды префиксуется именем табличной части,
//											которую заполняет указанный обработчик
//											Пример: "ТоварыЗаполнитьСкладскимиОстатками".
//
//	ИмяОбработчикаКоманды - Строка	-		Полное процедуры в менеджере объекта, которая будет вызвана для обработки
//											команды заполнения.Если не указано, то менеджер заполнения будет использовать имя команды.
//
//	ИмяТабличнойЧасти	  - Строка	-		Имя табличной части ,которую обрабатывает сервис заполнения.
//											Пример: "Товары".
//
//	ПредставлениеКоманды  - Строка	-		Представление команды в меню заполнения.
//											Пример: "Заполнить складскими остатками".
//
//	ПараметрыКоманды	  - Структура	-	Набор произвольных параметров, необходимых для заполнения объекта.
//											Пример: "Документ.СчетНаОплатуПокупателю".
//
//	ПорядокГруппы		  - Число		-	(необязательный) Значение от 0 до 100, указывающее порядок размещения группы команды
//											по отношению к другим группам. Сортировка команд меню заполнения осуществляется
//											сначала по полю ПорядокГруппы, затем по полю ПорядокВГруппе, затем по представлению.
//											Значение по умолчанию: 1.
//
//	ПорядокВГруппе		 - Число		-	(необязательный) Значение от 1 до 100, указывающее порядок размещения команды
//											по отношению к другим командам группы. Сортировка команд меню заполнения осуществляется
//											сначала по полю ПорядокГруппы, затем по полю ПорядокВГруппе, затем по представлению.
//											Значение по умолчанию: 1.
//
//	Картинка			 - Картинка		-	(необязательный) Картинка, которая отображается возле команды в меню Заполнение.
//											Пример: БиблиотекаКартинок.ФорматPDF.
//
//    ВидимостьКоманды      - Булево     - (необязательный) Признак того, отображать вообще команду или нет.
//
Функция СоздатьКоллекциюКомандЗаполнения(Форма, Объект) Экспорт
	
	КомандыЗаполнения = Новый ТаблицаЗначений;
	
	// Описание
	КомандыЗаполнения.Колонки.Добавить("ИмяКоманды",                    Новый ОписаниеТипов("Строка"));
	КомандыЗаполнения.Колонки.Добавить("ИмяОбработчикаКоманды",         Новый ОписаниеТипов("Строка"));
	КомандыЗаполнения.Колонки.Добавить("ИмяТабличнойЧасти",             Новый ОписаниеТипов("Строка"));
	КомандыЗаполнения.Колонки.Добавить("ПредставлениеКоманды",          Новый ОписаниеТипов("Строка"));
	КомандыЗаполнения.Колонки.Добавить("ПараметрыКоманды",              Новый ОписаниеТипов("Структура"));
	КомандыЗаполнения.Колонки.Добавить("ШаблонПараметрыКоманды",        Новый ОписаниеТипов("Структура"));
	КомандыЗаполнения.Колонки.Добавить("ОчиститьПередЗаполнением",      Новый ОписаниеТипов("Булево"));
	КомандыЗаполнения.Колонки.Добавить("ПодтверждениеПередЗаполнением", Новый ОписаниеТипов("Булево"));
	КомандыЗаполнения.Колонки.Добавить("ВидимостьКоманды",              Новый ОписаниеТипов("Булево"));
	КомандыЗаполнения.Колонки.Добавить("ИзменяетСохраняемыеДанные",     Новый ОписаниеТипов("Булево"));
	
	// Представление
	КомандыЗаполнения.Колонки.Добавить("ПорядокГруппы",            Новый ОписаниеТипов("Число"));
	КомандыЗаполнения.Колонки.Добавить("ПорядокВГруппе",           Новый ОписаниеТипов("Число"));
	КомандыЗаполнения.Колонки.Добавить("Картинка",                 Новый ОписаниеТипов("Картинка"));
	
	// Проверим, подключен ли к данному рабочему месту ТСД.
	ВозможнаРаботаТСД = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам("ТерминалСбораДанных").Количество() > 0;
		
	// Создадим список значений объектов.
	СписокДокументов = Новый СписокЗначений;
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		Если ОбъектМетаданных.ТабличныеЧасти.Количество() > 0 Тогда
			Если НЕ (ОбъектМетаданных.ТабличныеЧасти.Количество() = 1 
				И (ОбъектМетаданных.ТабличныеЧасти.Получить(0).Представление() = НСтр("ru = 'Дополнительные реквизиты'"))) 
				И ПравоДоступа("Просмотр",ОбъектМетаданных) Тогда
				
				СписокДокументов.Добавить(ОбъектМетаданных.Имя, УправлениеДиалогомСервер.ПредставлениеОбъект(ОбъектМетаданных),, 
					БиблиотекаКартинок.Документ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Заполним общие команды.
	Для Каждого ТабличнаяЧасть Из Объект.Ссылка.Метаданные().ТабличныеЧасти Цикл
		
		// Пропустим служебные табличные части.
		Если ТабличнаяЧасть.Имя="ДополнительныеРеквизиты" 
			ИЛИ ТабличнаяЧасть.Имя="КонтактнаяИнформация" 
			ИЛИ ТабличнаяЧасть.Имя="НаборыЗначенийДоступа" Тогда
			
			Продолжить;
		КонецЕсли;
		
		// Не будем добавлять команды для табличных частей у которых не предусмотрено заполнение.
		Если Форма.Элементы.Найти(ТабличнаяЧасть.Имя+"ПодменюЗаполнения")=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Команда очистки табличной части.
		ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, ТабличнаяЧасть.Имя+"ОчиститьТабличнуюЧасть",,
			ТабличнаяЧасть.Имя, НСтр("ru = 'Очистить табличную часть'"),, 
			БиблиотекаКартинок.ЗаполнениеДокументовОчиститьТабличнуюЧасть, 0);
		
		// Команда заполнения т/ч по данным другого документа.
		ПараметрыКоманды = Новый Структура();
		ПоследовательныеОперации.ДобавитьВыборИзСписка(ПараметрыКоманды, "ЗаполнитьПоДокументуВыборТипа", СписокДокументов,
			ИСТИНА, НСтр("ru = 'Выберите тип объекта'"),, "ЗаполнениеДокументовКлиент.ЗаполнитьПоДокументуВыборТипа");
		ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ЗаполнитьПоДокументуВыборСсылки", 
			"Документ.$ИмяДокумента$.ФормаСписка",,, ИСТИНА);
		ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, ТабличнаяЧасть.Имя+"ЗаполнитьПоДокументу", 
			"ЗаполнениеДокументовСервер.ЗаполнениеПоДокументу", ТабличнаяЧасть.Имя, НСтр("ru = 'Заполнить по документу'"), ПараметрыКоманды,, 35);
		
		// Команда заполнения из ТСД.
		Если ВозможнаРаботаТСД И ЕстьРеквизит(Объект,"Номенклатура",ТабличнаяЧасть.Имя) Тогда
			
			// Загрузка из ТСД.
			ПараметрыКоманды = Новый Структура();
			ПоследовательныеОперации.ДобавитьОперацию(ПараметрыКоманды, "ЗагрузитьИзТСД", 
				"ЗаполнениеДокументовКлиент.ЗагрузитьИзТСД", ИСТИНА);
			
			ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, ТабличнаяЧасть.Имя+"ЗагрузитьИзТСД",
				"ЗаполнениеДокументовСервер.ЗагрузитьИзТСД", ТабличнаяЧасть.Имя, НСтр("ru = 'Загрузить из ТСД'"), ПараметрыКоманды, БиблиотекаКартинок.ПодключаемоеОборудованиеТерминалСбораДанных16, 40);
			
			// Выгрузить в ТСД.
			ПараметрыКоманды = Новый Структура();
			ПоследовательныеОперации.ДобавитьОперацию(ПараметрыКоманды, "ВыгрузитьВТСД", "ЗаполнениеДокументовКлиент.ВыгрузитьВТСД", ИСТИНА, ТабличнаяЧасть.Имя);
			
			ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, ТабличнаяЧасть.Имя+"ВыгрузитьВТСД","ЗаполнениеДокументовСервер.ВыгрузитьВТСД", ТабличнаяЧасть.Имя, НСтр("ru = 'Выгрузить в ТСД'"), ПараметрыКоманды, БиблиотекаКартинок.ПодключаемоеОборудованиеТерминалСбораДанных16, 40,,ЛОЖЬ,,,ЛОЖЬ);
			
		КонецЕсли;
		
		// Команда заполнения из файла.
		Если ПравоПользователя("ОтображатьЗаполнитьИзФайла", Объект) Тогда
			
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", Ложь);
			ПараметрыФормы.Вставить("РежимЗагрузки",                             3);
			ПараметрыФормы.Вставить("ТабличнаяЧастьИсточника",                   ТабличнаяЧасть.Имя);
			ПараметрыФормы.Вставить("СсылкаИсточника",                           Объект.Ссылка);
			ПараметрыФормы.Вставить("ОбъектИсточника",                           Новый Структура("Объект",Объект));		
			ПараметрыФормы.Вставить("Контрагент",                                ?(Объект.Свойство("Контрагент"), 
				Объект.Контрагент, Неопределено));
			
			ПараметрыКоманды = Новый Структура();
			ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ЗагрузкаИзФайла", 
				"Обработка.ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПомощник", ПараметрыФормы,, ИСТИНА);
			
			ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, ТабличнаяЧасть.Имя
				+ "ЗагрузкаИзФайла","ЗаполнениеДокументовСервер.ЗагрузкаИзФайла", 
				ТабличнаяЧасть.Имя, НСтр("ru = 'Загрузить из файла'"), 
				ПараметрыКоманды, БиблиотекаКартинок.ЗаполнениеДокументовЗагрузитьИзФайла, 50);
			
		КонецЕсли;
		
		// Команда установки процента наценки.
		Если ЕстьРеквизит(Объект,"ПроцентНаценки",ТабличнаяЧасть.Имя) Тогда
			ПараметрыКоманды = Новый Структура();
			ПараметрыОперации = ПоследовательныеОперации.СоздатьПараметрыОперацииВводЧисла();
			ПараметрыОперации.ВводЧисла    = НСтр("ru = 'Введите процент наценки'");
			ПараметрыОперации.Длина        = 6;
			ПараметрыОперации.Обязательный = Истина;
			ПараметрыКоманды.Вставить("ЗначениеПроцента", ПараметрыОперации);
			ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, ТабличнаяЧасть.Имя + "УстановитьНаценкуДляВсейТаблицы", "ЗаполнениеДокументовСервер.УстановитьНаценкуДляВсейТаблицы", ТабличнаяЧасть.Имя, НСтр("ru = 'Установить % наценки для всей таблицы'"), ПараметрыКоманды,,,,Ложь,Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КомандыЗаполнения;
	
КонецФункции // СоздатьКоллекциюКомандЗаполнения()
